# force join message
FORCE_JOIN_MESSAGE = '''
کاربر {} عزیز

⚠️ جهت ادامه کار نیاز است در کانال نیتروسین بت عضو شوید.
@dicegametestbot

👈🏻 بعد از عضویت مجددا /start را ارسال نمایید.
'''

# welcome message
WELCOME_MESSAGE = '''
سلام {}،به دایس گیم تست بت خوش آمدید 💫

👈🏻 با دایس گیم تست بت میتوانید سکه های دایس گیم خود را کاملا اتومات چند برابر کنید😍😍
برای ادامه یکی از دکمه های زیر را انتخاب نمایید:
'''

# main menu buttons text
PLAY_GAME_TEXT = '🎮شروع بازی'
TRANSFORM_COINS_TEXT = '💸انتقال سکه'
USER_ACCOUNT_TEXT = '👤حساب کاربری'
SUPPORT_TEXT = '🆘 پشتیبانی'
INCREASE_INVENTORY_TEXT = '➕ افزایش موجودی'
INFORMATION_TEXT = '📖'

