# force join message
FORCE_JOIN_MESSAGE = '''
کاربر {} عزیز

⚠️ جهت ادامه کار نیاز است در کانال نیتروسین بت عضو شوید.
@dicegametestbot

👈🏻 بعد از عضویت مجددا /start را ارسال نمایید.
'''

# welcome message
WELCOME_MESSAGE = '''
سلام {}،به دایس گیم تست بت خوش آمدید 💫

👈🏻 با دایس گیم تست بت میتوانید سکه های دایس گیم خود را کاملا اتومات چند برابر کنید😍😍
برای ادامه یکی از دکمه های زیر را انتخاب نمایید:
'''

# cancel
CANCEL_TEXT = 'انصراف'

# back
BACK_TEXT = '🔙 بازگشت'
RETURNED_TO_MAIN_MENU_TEXT = '👈🏻 به منوی اصلی بازگشتید.'

# main menu buttons text
PLAY_GAME_TEXT = '🎮شروع بازی'
TRANSFORM_COINS_TEXT = '💸انتقال سکه'
USER_ACCOUNT_TEXT = '👤حساب کاربری'
SUPPORT_TEXT = '🆘 پشتیبانی'
INCREASE_INVENTORY_TEXT = '➕ افزایش موجودی'
BOOK_ICON_TEXT = '📖'

# user account message
USER_INFORMATION_TEXT = '''
👤 شناسه شما: {}
📅 تاریخ عضویت: {}
👥 زیرمجموعه: {} نفر
💰 موجودی شما: {} سکه

@dicegametestbot - {}
'''

# transform coins message
TRANSFORM_COINS_MESSAGE = '''
❓ تعداد سکه موردنظر جهت انتقال را وارد نمایید:

• موجودی شما: {} سکه
'''
TRANSFORM_INVALID_TEXT = '''
❌ این انتقال قابل انجام نیست! برای انتقال نیاز است که 300 سکه داخل حساب خودتان باقی بماند.!
'''

# increase inventory message and text
INVITE_USER_TEXT = '👤 زیرمجموعه گیری'
TRANSFORM_NITROSEEN_TEXT = '💵 انتقال نیتروسین'
TRANSFORM_NITROSEEN_MESSAGE = '''
برای شارژ حساب خود باید سکه ربات نیتروسین (bot link) را برای کاربری user_id انتقال دهید😊

کاربری: user_id

‼️توجه: بعد از انتقال اتومات حسابی که با آن انتقال دادید شارژ میشه.
'''
INCREASE_INVENTORY_MESSAGE = '''
یک بخش را جهت افزایش موجودی انتخاب کنید:
'''

# bot support text
BOT_SUPPORT_TEXT = '''
🔰 تیم پشتیبانی نیتروسین بت با افتخار آماده پاسخگویی به شما عزیزان است:
@moawezz
'''

# bot instruction message
BOT_INSTRUCTION_MESSAGE = '''
👈🏻چگونه حساب خود را شارژ کنم؟
برای شارژ حساب خود کافیست سکه های نیتروسین خود را به کاربری {} انتقال دهید و اتومات بعد از انتقال حساب شما شارژ میشود.

👈🏻بردم،چطور جایزه را دریافت کنم؟
ربات به صورت اتومات بین 1 تا 10 دقیقه بعد از برد شما،جایزه را به حساب کاربری شما انتقال میدهد و برای شما پیام انتقال را ارسال میکند.

👈🏻موجودی دارم چطور برداشت کنم؟
در حال حاضر فقط با بازی کردن و شرط بستن میتوانید سکه نیتروسین بگیرید
'''

# user invite link
USER_INVITE_LINK = 'https://t.me/dicegametestbot?start={}'
INVITE_MESSAGE = '''
⚡️ با نیتروسین بت به راحتی سکه های نیتروسین خود را چند برابر کنید!

🤯کاملا اتومات بعد از انتقال نیترو به کاربری مورد نظر حساب شما در ربات شارژ شده و بعد از بردن اتومات برای شما واریز میشود🤩

📌 همین حالا رایگان امتحان کن👇👇

{}
'''
INVITE_INFO_TEXT = '''
💡 به ازای هر شخصی که برای اولین بار با لینک شما عضو ربات شود 300 سکه دریافت خواهید کرد.
برای شروع بنر بالا را به دوستان و آشنایان خود ارسال کنید.
'''